src/Documents/ОкончаниеАренды/ОкончаниеАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОкончаниеАренды</name>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СостояниеНоменклатуры/СостояниеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНоменклатуры</name>
  <comment>Описывает все возможные состояния номенклатуры</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЭксплуатации</name>
    <comment>Пустая ссылка - все нормально, иначе см. основание</comment>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ОкончаниеАренды/ObjectModule.bsl
//@strict-types

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Срез = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(Дата,
		Новый Структура(Метаданные.РегистрыСведений.СостояниеНоменклатуры.Измерения.Товар.Имя, Товар));

	Если Срез.Количество() > 0 Тогда
		Если Срез[0][Метаданные.РегистрыСведений.СостояниеНоменклатуры.Ресурсы.Арендатор.Имя] <> Клиент Тогда
			СообщенияКлиентСервер.СообщитьСоСвойствами("Товар не арендован указанным клиентом.", "Товар", ЭтотОбъект);
			Отказ = Истина;
		КонецЕсли;

		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СостояниеНоменклатуры
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Арендатор = Справочники.Клиенты.ПустаяСсылка();
	Движение.Станция = Станция;
	Движение.СостояниеЭксплуатации = Перечисления.ОснованияВыводаТовараИзЭксплуатации.ПустаяСсылка();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
